###
# #%L
# xplan-validator-core - XPlan Validator Core Komponente
# %%
# Copyright (C) 2008 - 2023 Freie und Hansestadt Hamburg, developed by lat/lon gesellschaft für raumbezogene Informationssysteme mbH
# %%
# This program is free software: you can redistribute it and/or modify
# it under the terms of the GNU Affero General Public License as published by
# the Free Software Foundation, either version 3 of the License, or
# (at your option) any later version.
# 
# This program is distributed in the hope that it will be useful,
# but WITHOUT ANY WARRANTY; without even the implied warranty of
# MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the
# GNU General Public License for more details.
# 
# You should have received a copy of the GNU Affero General Public License
# along with this program.  If not, see <http://www.gnu.org/licenses/>.
# #L%
###
# This file stores localized messages for the Xerces DOM implementation.
# Translation based on the german xerces impl jar: http://www.java2s.com/Code/Jar/x/DownloadxercesImpldejar.htm

BadMessageKey = Die zur Meldungs-ID geh\u00F6rende Fehlermeldung wurde nicht gefunden.
FormatFailed = Beim Formatieren der folgenden Meldung ist ein interner Fehler aufgetreten:\n  

# DOM Core

# exception codes
DOMSTRING_SIZE_ERR = Der angegebene Textbereich passt nicht in einen DOMString. 
HIERARCHY_REQUEST_ERR  = Es wurde versucht, einen Knoten an einer nicht zul\u00E4ssigen Stelle einzuf\u00FCgen. 
INDEX_SIZE_ERR = Die Indexposition oder Gr\u00F6\u00DFe ist negativ oder gr\u00F6\u00DFer als der zul\u00E4ssige Wert.
INUSE_ATTRIBUTE_ERR = Es wird versucht, ein bereits an anderer Stelle verwendetes Attribut hinzuf\u00FCgen.
INVALID_ACCESS_ERR  = Ein Parameter oder eine Methode wird vom zugrundeliegenden Objekt nicht unterst\u00FCtzt. 
INVALID_CHARACTER_ERR = Es wurde ein ung\u00FCltiges oder unzul\u00E4ssiges XML-Zeichen angegeben. 
INVALID_MODIFICATION_ERR =  Es wird versucht, den Typ des zugrundeliegenden Objekts zu\u00E4ndern. 
INVALID_STATE_ERR = Es wird versucht, ein Objekt zu verwenden, das nicht (mehr) verwendbar ist. 
NAMESPACE_ERR = Es wird versucht, ein Objekt in einer Weise zu erstellen oder zu\u00E4ndern, die im Hinblick auf Namespaces falsch ist.
NOT_FOUND_ERR = Es wird versucht, in einem Kontext auf einen Knoten zu verweisen, in dem es den Knoten nicht gibt.
NOT_SUPPORTED_ERR = Die Implementierung unterst\u00FCtzt den gew\u00FCnschten Objekt- oder Methodentyp nicht. 
NO_DATA_ALLOWED_ERR = Es wurden Daten f\u00FCr einen Knoten angegeben, der keine Daten unterst\u00FCtzt.
NO_MODIFICATION_ALLOWED_ERR = Es wird versucht, ein Objekt zu\u00E4ndern, bei dem keine\u00E4nderungen erlaubt sind.
SYNTAX_ERR = Es wurde eine unzul\u00E4ssige oder ung\u00FCltige Zeichenfolge angegeben. 
VALIDATION_ERR = Ein Aufruf einer Methode wie "insertBefore" oder "removeChild" w\u00FCrde den Knoten im Hinblick auf die Dokumentgrammatik ung\u00FCltig machen.
WRONG_DOCUMENT_ERR = Ein Knoten wird in einem anderen Dokument als dem verwendet, das den Knoten erstellt hat.
TYPE_MISMATCH_ERR = Der Werttyp dieses Parameternamens ist mit dem erwarteten Werttyp nicht kompatibel. 
 
#error messages or exceptions
FEATURE_NOT_SUPPORTED = Der Parameter {0} wurde zwar erkannt, der gew\u00FCnschte Wert kann jedoch nicht festgelegt werden.
FEATURE_NOT_FOUND = Der Parameter {0} wurde nicht erkannt.
STRING_TOO_LONG   = Die sich daraus ergebende Zeichenfolge ist zu lang, um in einen DOMString zu passen: ''{0}''.

#DOM Level 3 DOMError codes
wf-invalid-character =  Der Text {0} des Knotens {1} enth\u00E4lt ung\u00FCltige XML-Zeichen.
wf-invalid-character-in-node-name = Der {0}-Knoten mit dem Namen {1} enth\u00E4lt ung\u00FCltige XML-Zeichen.
cdata-sections-splitted =  CDATA-Abschnitte, die die CDATA-Abschnittendmarke "]]>" enthalten
doctype-not-allowed = DOCTYPE-Deklaration ist nicht zul\u00E4ssig.
unsupported-encoding = Die Kodierung {0} wird nicht unterst\u00FCtzt.

#Error codes used in DOM Normalizer
InvalidXMLCharInDOM = Ung\u00FCltiges XML-Zeichen (Unicode: 0x{0}) w\u00E4hrend der Normalisierung im DOM gefunden.
UndeclaredEntRefInAttrValue = Wert "{1}" des Attributs ""{0}" hat auf eine Entit\u00E4t verwiesen, die nicht deklariert war.
NullLocalElementName = Bei der Namespace-Normalisierung des Elements {0} wurde f\u00FCr einen lokalen Namen null gefunden.
NullLocalAttrName = Bei der Namespace-Normalisierung des Attributs {0} wurde f\u00FCr einen lokalen Namen null gefunden.

#Error codes used in DOMParser
InvalidDocumentClassName = Der zur Konstruktion der DOM-Struktur verwendete Klassenname der Dokumentfactory "{0}" hat nicht den Typ org.w3c.dom.Document.
MissingDocumentClassName = Der zur Konstruktion der DOM-Struktur verwendete Klassenname der Dokumentfactory "{0}" konnte nicht gefunden werden.
CannotCreateDocumentClass = Die Klasse mit dem Namen "{0}" konnte nicht als org.w3c.dom.Document konstruiert werden.
CannotQueryDeferredNode = Aktueller Elementknoten kann nicht abgefragt werden, wenn Knotenerweiterung verz\u00F6gert ist.

# Error codes used by JAXP DocumentBuilder
jaxp-order-not-supported = Eigenschaft "{0}" muss vor Eigenschaft "{1}" gesetzt werden.
jaxp-null-input-source = Die angegebene Quelle darf nicht null sein.

#Ranges
BAD_BOUNDARYPOINTS_ERR = Die Begrenzungspunkte eines Bereichs erf\u00FCllen bestimmte Bedingungen nicht.
INVALID_NODE_TYPE_ERR = Der Container eines Begrenzungspunkts eines Bereichs wird gerade entweder auf einen Knoten ung\u00FCltigen Typs oder einen Knoten mit einem Vorg\u00E4nger ung\u00FCltigen Typs gesetzt.


#Events
UNSPECIFIED_EVENT_TYPE_ERR = Der Ereignistyp wurde nicht durch Initialisierung des Ereignisses vor dem Aufrufen der Methode angegeben. 
